taurus_playground/test_volume/merged.yml
---
execution:
- concurrency: 1000
  hold-for: 5m
  ramp-up: 1m
  scenario: quick-test
reporting:
- module: console
- dump-csv: results.csv
  dump-xml: results.xml
  failed-labels: true
  module: final-stats
  percentiles: true
  summary: true
  summary-labels: true
  test-duration: true
scenarios:
  quick-test:
    requests:
    - http://localhost:8080